魔塔刷新区域表 = {
    "九层魔塔一层",
    "九层魔塔二层",
    "九层魔塔三层",
    "九层魔塔四层",
    "九层魔塔五层",
    "九层魔塔六层",
    "九层魔塔七层",
    "九层魔塔八层",
    "九层魔塔九层",
}

魔塔传送阵刷新表 = {
    Point(1036, 79),
    Point(898, 217),
    Point(761, 354),
    Point(1156, 199),
    Point(1018, 337),
    Point(881, 474),
    Point(1281, 324),
    Point(1143, 462),
    Point(1006, 599),
}

function 九层魔塔_执行(地图)
    if 地图.数字变量[数字_魔塔级别] == 0 then
        if 主程.当前时间 > 地图.节点计时 then
            if 地图.玩家列表.Count == 0 then
                地图.副本节点 = 255
            end
            if 地图.副本节点 == 255 then
                地图:关闭副本()
            elseif 地图.副本节点 == 0 then
                地图.副本节点 = 10
                地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
            elseif 地图.副本节点 > 9 then
                local 节点 = 地图.副本节点 % 10
                local 层数 = 地图.副本节点 // 10
                if 节点 == 0 then
                    if 层数 == 1 then
                        地图:地图公告("<#T:990638>") --九层魔塔的封印已解除！ 望各位勇士量力而行，莫要有来无归
                    elseif 层数 == 2 or 层数 == 3 or 层数 == 4 or 层数 == 6 or 层数 == 7 or 层数 == 8 then
                        地图:地图公告("<#T:990636>") --新一波魔物
                    elseif 层数 == 5 or 层数 == 9 then
                        地图:地图公告("<#T:990637>") --一股浓烈的死亡气息正在慢慢逼近，你们会被吞噬吗？
                    end
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
                elseif 节点 == 1 then
                    if 层数 == 1 then
                        地图:地图公告("<#T:990638>") --九层魔塔的封印已解除！ 望各位勇士量力而行，莫要有来无归
                    elseif 层数 == 2 or 层数 == 3 or 层数 == 4 or 层数 == 6 or 层数 == 7 or 层数 == 8 then
                        地图:地图公告("<#T:990636>") --新一波魔物
                    elseif 层数 == 5 or 层数 == 9 then
                        地图:地图公告("<#T:990637>") --一股浓烈的死亡气息正在慢慢逼近，你们会被吞噬吗？
                    end
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
                elseif 节点 == 2 then
                    if 层数 == 1 then
                        地图:地图公告("<#T:990639>") --撕碎他们
                        local BUFF层数 = 0
                        local 玩家列表 = 地图:获取玩家列表()
                        for i = 0, 玩家列表.Count - 1 do
                            local 玩家 = 玩家列表[i]
                            if 玩家.角色职业 == 游戏对象职业.战士 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.法师 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.道士 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.刺客 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.弓手 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.龙枪 then
                                BUFF层数 = BUFF层数 + 1
                            end
                        end
                        for i = 0, 玩家列表.Count - 1 do
                            local 玩家 = 玩家列表[i]
                            玩家:添加Buff时处理(2563, nil)
                            玩家:添加Buff时处理(2571, nil)
                            玩家:增加Buff层数(2571, (BUFF层数 - 1))
                        end
                    elseif 层数 == 2 or 层数 == 6 or 层数 == 7 or 层数 == 8 then
                        地图:地图公告("<#T:990653>") --生而无息
                    elseif 层数 == 3 or 层数 == 4 then
                        地图:地图公告("<#T:990639>") --撕碎他们
                    end
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
                elseif 节点 == 3 then
                    local 随机值 = randomNum(0,2,true)
                    if 层数 == 1 then
                        范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, Point(1042, 73), true, true)
                        范围刷新怪物从地图实例("邪骸影射01", 地图, 0, Point(1043, 72), true, true)
                        范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, Point(1042, 85), true, true)
                        范围刷新怪物从地图实例("邪骸影射01", 地图, 0, Point(1043, 86), true, true)
                        范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, Point(1030, 85), true, true)
                        范围刷新怪物从地图实例("邪骸影射01", 地图, 0, Point(1029, 86), true, true)
                        范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, Point(1030, 73), true, true)
                        范围刷新怪物从地图实例("邪骸影射01", 地图, 0, Point(1029, 72), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, Point(1048, 77), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1048, 78), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1048, 79), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, Point(1036, 91), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1036, 92), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1036, 93), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, Point(1022, 80), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1022, 81), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1022, 82), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, Point(1036, 65), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1036, 66), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1036, 67), true, true)
                    elseif 层数 == 2 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, Point(893, 211), true, true)
                            范围刷新怪物从地图实例("邪骸影射02", 地图, 0, Point(892, 210), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, Point(904, 210), true, true)
                            范围刷新怪物从地图实例("邪骸影射02", 地图, 0, Point(905, 209), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, Point(904, 222), true, true)
                            范围刷新怪物从地图实例("邪骸影射02", 地图, 0, Point(905, 223), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, Point(892, 222), true, true)
                            范围刷新怪物从地图实例("邪骸影射02", 地图, 0, Point(891, 223), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(885, 217), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(885, 218), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(885, 219), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(898, 204), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(898, 205), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(898, 206), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(911, 217), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(911, 218), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(911, 219), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(897, 231), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(897, 232), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(897, 233), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将02", 地图, 0, Point(905, 217), true, true)
                            范围刷新怪物从地图实例("镇妖神将02", 地图, 0, Point(891, 217), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("重甲狂兽人02", 地图, 0, Point(903, 222), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(903, 223), true, true)
    
                            范围刷新怪物从地图实例("破法狂兽人02", 地图, 0, Point(893, 212), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(893, 213), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(893, 222), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(903, 212), true, true)
                        end
                    elseif 层数 == 3 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, Point(767, 348), true, true)
                            范围刷新怪物从地图实例("邪骸影射03", 地图, 0, Point(768, 347), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, Point(767, 359), true, true)
                            范围刷新怪物从地图实例("邪骸影射03", 地图, 0, Point(768, 360), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, Point(755, 360), true, true)
                            范围刷新怪物从地图实例("邪骸影射03", 地图, 0, Point(754, 361), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, Point(756, 348), true, true)
                            范围刷新怪物从地图实例("邪骸影射03", 地图, 0, Point(755, 347), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(762, 342), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(762, 343), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(762, 344), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(774, 353), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(774, 354), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(774, 355), true, true)
                            
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(761, 366), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(761, 367), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(761, 368), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(749, 354), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(749, 354), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(749, 354), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将03", 地图, 0, Point(768, 354), true, true)
                            范围刷新怪物从地图实例("镇妖神将03", 地图, 0, Point(754, 354), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("重甲狂兽人03", 地图, 0, Point(766, 358), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(766, 359), true, true)
    
                            范围刷新怪物从地图实例("破法狂兽人03", 地图, 0, Point(757, 349), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(757, 350), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(756, 359), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(767, 348), true, true)
                        end
                    elseif 层数 == 4 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, Point(1162, 193), true, true)
                            范围刷新怪物从地图实例("邪骸影射04", 地图, 0, Point(1163, 192), true, true)
                            范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, Point(1162, 204), true, true)
                            范围刷新怪物从地图实例("邪骸影射04", 地图, 0, Point(1163, 205), true, true)
                            范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, Point(1150, 205), true, true)
                            范围刷新怪物从地图实例("邪骸影射04", 地图, 0, Point(1149, 206), true, true)
                            范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, Point(1151, 193), true, true)
                            范围刷新怪物从地图实例("邪骸影射04", 地图, 0, Point(1150, 192), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1157, 186), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1157, 186), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1157, 186), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1169, 198), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1169, 199), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1169, 200), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1155, 212), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1155, 212), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1155, 212), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1143, 200), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1143, 200), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1143, 200), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将04", 地图, 0, Point(1163, 199), true, true)
                            范围刷新怪物从地图实例("镇妖神将04", 地图, 0, Point(1149, 199), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("重甲狂兽人04", 地图, 0, Point(1161, 204), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1161, 205), true, true)
    
                            范围刷新怪物从地图实例("破法狂兽人04", 地图, 0, Point(1151, 194), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1151, 193), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1151, 204), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1161, 194), true, true)
                        end
                    elseif 层数 == 5 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("秘法之囚01", 地图, 0, Point(1017, 337), true, true)
                            地图:地图公告("<#T:990646>") --此妖王是 [秘法之囚]，使用法术攻击有奇效！
                            地图:地图公告("<#T:990646>") --此妖王是 [秘法之囚]，使用法术攻击有奇效！
                        else
                            范围刷新怪物从地图实例("神武之囚01", 地图, 0, Point(1017, 337), true, true)
                            地图:地图公告("<#T:990645>") --此妖王是 [神武之囚]，使用物理攻击有奇效！
                            地图:地图公告("<#T:990645>") --此妖王是 [神武之囚]，使用物理攻击有奇效！
                        end
                        范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1012, 337), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1012, 338), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1012, 339), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1018, 331), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1018, 332), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1018, 333), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1024, 337), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1024, 338), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1024, 339), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1018, 343), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1018, 344), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1018, 345), true, true)
                    elseif 层数 == 6 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, Point(875, 480), true, true)
                            范围刷新怪物从地图实例("邪骸影射06", 地图, 0, Point(874, 481), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, Point(887, 468), true, true)
                            范围刷新怪物从地图实例("邪骸影射06", 地图, 0, Point(888, 467), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, Point(887, 479), true, true)
                            范围刷新怪物从地图实例("邪骸影射06", 地图, 0, Point(888, 480), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, Point(876, 468), true, true)
                            范围刷新怪物从地图实例("邪骸影射06", 地图, 0, Point(875, 467), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(868, 475), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(868, 476), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(882, 461), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(882, 462), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(894, 473), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(894, 474), true, true)
                            
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(880, 487), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(880, 487), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将06", 地图, 0, Point(888, 474), true, true)
                            范围刷新怪物从地图实例("镇妖神将06", 地图, 0, Point(874, 474), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("霸体狂尸06", 地图, 0, Point(888, 480), true, true)
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(888, 481), true, true)
    
                            范围刷新怪物从地图实例("破法邪尸06", 地图, 0, Point(875, 467), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(875, 466), true, true)
    
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(875, 480), true, true)
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(888, 467), true, true)
                        end
                    elseif 层数 == 7 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, Point(1276, 318), true, true)
                            范围刷新怪物从地图实例("邪骸影射07", 地图, 0, Point(1275, 317), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, Point(1287, 318), true, true)
                            范围刷新怪物从地图实例("邪骸影射07", 地图, 0, Point(1288, 317), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, Point(1287, 329), true, true)
                            范围刷新怪物从地图实例("邪骸影射07", 地图, 0, Point(1288, 330), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, Point(1275, 330), true, true)
                            范围刷新怪物从地图实例("邪骸影射07", 地图, 0, Point(1274, 331), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1268, 325), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1268, 326), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1282, 311), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1282, 312), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1294, 323), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1294, 324), true, true)
                            
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1280, 337), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1280, 338), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将07", 地图, 0, Point(1288, 325), true, true)
                            范围刷新怪物从地图实例("镇妖神将07", 地图, 0, Point(1274, 325), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("霸体狂尸07", 地图, 0, Point(1288, 331), true, true)
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1288, 332), true, true)
    
                            范围刷新怪物从地图实例("破法邪尸07", 地图, 0, Point(1275, 318), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1275, 317), true, true)
    
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1275, 331), true, true)
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1287, 319), true, true)
                        end
                    elseif 层数 == 8 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, Point(1138, 456), true, true)
                            范围刷新怪物从地图实例("邪骸影射08", 地图, 0, Point(1137, 455), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, Point(1149, 456), true, true)
                            范围刷新怪物从地图实例("邪骸影射08", 地图, 0, Point(1150, 455), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, Point(1149, 467), true, true)
                            范围刷新怪物从地图实例("邪骸影射08", 地图, 0, Point(1150, 468), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, Point(1137, 468), true, true)
                            范围刷新怪物从地图实例("邪骸影射08", 地图, 0, Point(1136, 469), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1130, 463), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1130, 464), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1144, 449), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1144, 450), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1156, 461), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1156, 462), true, true)
                            
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1142, 475), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1142, 476), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将08", 地图, 0, Point(1150, 463), true, true)
                            范围刷新怪物从地图实例("镇妖神将08", 地图, 0, Point(1136, 463), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("霸体狂尸08", 地图, 0, Point(1150, 469), true, true)
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1150, 470), true, true)
    
                            范围刷新怪物从地图实例("破法邪尸08", 地图, 0, Point(1137, 456), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1137, 455), true, true)
    
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1137, 468), true, true)
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1149, 456), true, true)
                            地图:地图公告("<#T:990640>") --能力异常的怪物出现了！请冷静应对！
                            地图:地图公告("<#T:990643>") --这些魔物免疫特定攻击，勇士请注意您的攻击是否有效！
                            地图:地图公告("<#T:990643>") --这些魔物免疫特定攻击，勇士请注意您的攻击是否有效！
                        end
                    elseif 层数 == 9 then
                        if randomNum(0,1,true) == 0 then
                            范围刷新怪物从地图实例("秘法之囚02", 地图, 0, Point(1006, 601), true, true)
                        else
                            范围刷新怪物从地图实例("神武之囚02", 地图, 0, Point(1006, 601), true, true)
                        end
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1000, 599), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1000, 600), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1000, 601), true, true)
                        
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1006, 605), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1006, 606), true, true)
                        范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1006, 607), true, true)
    
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1012, 598), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1012, 599), true, true)
                        范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1012, 600), true, true)
    
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1007, 593), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1007, 594), true, true)
                        范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1007, 595), true, true)
                    end
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
                elseif 节点 == 4 then
                    if 地图.存活怪物总数 ~= 0 then
    
                    else
                        地图.副本节点 = 地图.副本节点 + 1
                        地图.节点计时 = 主程.当前时间:AddSeconds(1.0)
                    end
                elseif 节点 == 5 then
                    local 玩家列表 = 地图:获取玩家列表()
                    for i = 0, 玩家列表.Count - 1 do
                        local 玩家 = 玩家列表[i]
                        玩家.角色数据.脚本变量[数字_魔塔个人标准层数记录] = 层数
                    end
                    地图:地图公告("<#P0:".. 层数 .."><#P1:0><#T:666728>") --第[`~]波妖物已清除，请点击传送阵通往下层！
                    -- 地图:地图公告("<#P0:".. 层数 .."><#P1:10><#P2:20><#T:990314>")
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(1.0)
                elseif 节点 == 6 then
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddHours(1.0)
                    if 层数 == 1 then
                        刷新守卫从地图实例(7000, 地图, 游戏方向.下方, 魔塔传送阵刷新表[层数])
                        刷新守卫从地图实例(6813, 地图, 游戏方向.下方, Point(1040, 81))
                        刷新守卫从地图实例(6815, 地图, 游戏方向.下方, Point(1039, 82))
                    else
                        刷新守卫从地图实例(7000, 地图, 游戏方向.下方, 魔塔传送阵刷新表[层数])
                    end
                    if 层数 == 9 then
                        地图:地图公告("<#T:666729>") --恭喜您通过了所有的挑战！请点击传送阵离开魔塔！
                    else
                        地图:地图公告("<#T:50030>") --传送阵已开启，请点击前往下一层！
                    end
                end
            end
        end
    end

    if 地图.数字变量[数字_魔塔级别] == 1 then
        if 主程.当前时间 > 地图.节点计时 then
            if 地图.玩家列表.Count == 0 then
                地图.副本节点 = 255
            end
            if 地图.副本节点 == 255 then
                地图:关闭副本()
            elseif 地图.副本节点 == 0 then
                地图.副本节点 = 10
                地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
            elseif 地图.副本节点 > 9 then
                local 节点 = 地图.副本节点 % 10
                local 层数 = 地图.副本节点 // 10
                if 节点 == 0 then
                    if 层数 == 1 then
                        地图:地图公告("<#T:990638>") --九层魔塔的封印已解除！ 望各位勇士量力而行，莫要有来无归
                    elseif 层数 == 2 or 层数 == 3 or 层数 == 4 or 层数 == 6 or 层数 == 7 or 层数 == 8 then
                        地图:地图公告("<#T:990636>") --新一波魔物
                    elseif 层数 == 5 or 层数 == 9 then
                        地图:地图公告("<#T:990637>") --一股浓烈的死亡气息正在慢慢逼近，你们会被吞噬吗？
                    end
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
                elseif 节点 == 1 then
                    if 层数 == 1 then
                        地图:地图公告("<#T:990638>") --九层魔塔的封印已解除！ 望各位勇士量力而行，莫要有来无归
                    elseif 层数 == 2 or 层数 == 3 or 层数 == 4 or 层数 == 6 or 层数 == 7 or 层数 == 8 then
                        地图:地图公告("<#T:990636>") --新一波魔物
                    elseif 层数 == 5 or 层数 == 9 then
                        地图:地图公告("<#T:990637>") --一股浓烈的死亡气息正在慢慢逼近，你们会被吞噬吗？
                    end
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
                elseif 节点 == 2 then
                    if 层数 == 1 then
                        地图:地图公告("<#T:990639>") --撕碎他们
                        local BUFF层数 = 0
                        local 玩家列表 = 地图:获取玩家列表()
                        for i = 0, 玩家列表.Count - 1 do
                            local 玩家 = 玩家列表[i]
                            if 玩家.角色职业 == 游戏对象职业.战士 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.法师 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.道士 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.刺客 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.弓手 then
                                BUFF层数 = BUFF层数 + 1
                            elseif 玩家.角色职业 == 游戏对象职业.龙枪 then
                                BUFF层数 = BUFF层数 + 1
                            end
                        end
                        for i = 0, 玩家列表.Count - 1 do
                            local 玩家 = 玩家列表[i]
                            玩家:添加Buff时处理(2563, nil)
                            玩家:添加Buff时处理(2571, nil)
                            玩家:增加Buff层数(2571, (BUFF层数 - 1))
                        end
                    elseif 层数 == 2 or 层数 == 6 or 层数 == 7 or 层数 == 8 then
                        地图:地图公告("<#T:990653>") --生而无息
                    elseif 层数 == 3 or 层数 == 4 then
                        地图:地图公告("<#T:990639>") --撕碎他们
                    end
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
                elseif 节点 == 3 then
                    local 随机值 = randomNum(0,2,true)
                    if 层数 == 1 then
                        范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, Point(1042, 73), true, true)
                        范围刷新怪物从地图实例("邪骸影射01", 地图, 0, Point(1043, 72), true, true)
                        范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, Point(1042, 85), true, true)
                        范围刷新怪物从地图实例("邪骸影射01", 地图, 0, Point(1043, 86), true, true)
                        范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, Point(1030, 85), true, true)
                        范围刷新怪物从地图实例("邪骸影射01", 地图, 0, Point(1029, 86), true, true)
                        范围刷新怪物从地图实例("邪骸精兵01", 地图, 0, Point(1030, 73), true, true)
                        范围刷新怪物从地图实例("邪骸影射01", 地图, 0, Point(1029, 72), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, Point(1048, 77), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1048, 78), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1048, 79), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, Point(1036, 91), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1036, 92), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1036, 93), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, Point(1022, 80), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1022, 81), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1022, 82), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸01", 地图, 0, Point(1036, 65), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1036, 66), true, true)
                        范围刷新怪物从地图实例("干枯僵尸01", 地图, 0, Point(1036, 67), true, true)
                    elseif 层数 == 2 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, Point(893, 211), true, true)
                            范围刷新怪物从地图实例("邪骸影射02", 地图, 0, Point(892, 210), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, Point(904, 210), true, true)
                            范围刷新怪物从地图实例("邪骸影射02", 地图, 0, Point(905, 209), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, Point(904, 222), true, true)
                            范围刷新怪物从地图实例("邪骸影射02", 地图, 0, Point(905, 223), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵02", 地图, 0, Point(892, 222), true, true)
                            范围刷新怪物从地图实例("邪骸影射02", 地图, 0, Point(891, 223), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(885, 217), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(885, 218), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(885, 219), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(898, 204), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(898, 205), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(898, 206), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(911, 217), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(911, 218), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(911, 219), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(897, 231), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(897, 232), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(897, 233), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将02", 地图, 0, Point(905, 217), true, true)
                            范围刷新怪物从地图实例("镇妖神将02", 地图, 0, Point(891, 217), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("重甲狂兽人02", 地图, 0, Point(903, 222), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(903, 223), true, true)
    
                            范围刷新怪物从地图实例("破法狂兽人02", 地图, 0, Point(893, 212), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(893, 213), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸02", 地图, 0, Point(893, 222), true, true)
                            范围刷新怪物从地图实例("干枯僵尸02", 地图, 0, Point(903, 212), true, true)
                        end
                    elseif 层数 == 3 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, Point(767, 348), true, true)
                            范围刷新怪物从地图实例("邪骸影射03", 地图, 0, Point(768, 347), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, Point(767, 359), true, true)
                            范围刷新怪物从地图实例("邪骸影射03", 地图, 0, Point(768, 360), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, Point(755, 360), true, true)
                            范围刷新怪物从地图实例("邪骸影射03", 地图, 0, Point(754, 361), true, true)
    
                            范围刷新怪物从地图实例("邪骸精兵03", 地图, 0, Point(756, 348), true, true)
                            范围刷新怪物从地图实例("邪骸影射03", 地图, 0, Point(755, 347), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(762, 342), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(762, 343), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(762, 344), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(774, 353), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(774, 354), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(774, 355), true, true)
                            
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(761, 366), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(761, 367), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(761, 368), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(749, 354), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(749, 354), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(749, 354), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将03", 地图, 0, Point(768, 354), true, true)
                            范围刷新怪物从地图实例("镇妖神将03", 地图, 0, Point(754, 354), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("重甲狂兽人03", 地图, 0, Point(766, 358), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(766, 359), true, true)
    
                            范围刷新怪物从地图实例("破法狂兽人03", 地图, 0, Point(757, 349), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(757, 350), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸03", 地图, 0, Point(756, 359), true, true)
                            范围刷新怪物从地图实例("干枯僵尸03", 地图, 0, Point(767, 348), true, true)
                        end
                    elseif 层数 == 4 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, Point(1162, 193), true, true)
                            范围刷新怪物从地图实例("邪骸影射04", 地图, 0, Point(1163, 192), true, true)
                            范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, Point(1162, 204), true, true)
                            范围刷新怪物从地图实例("邪骸影射04", 地图, 0, Point(1163, 205), true, true)
                            范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, Point(1150, 205), true, true)
                            范围刷新怪物从地图实例("邪骸影射04", 地图, 0, Point(1149, 206), true, true)
                            范围刷新怪物从地图实例("邪骸精兵04", 地图, 0, Point(1151, 193), true, true)
                            范围刷新怪物从地图实例("邪骸影射04", 地图, 0, Point(1150, 192), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1157, 186), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1157, 186), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1157, 186), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1169, 198), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1169, 199), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1169, 200), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1155, 212), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1155, 212), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1155, 212), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1143, 200), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1143, 200), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1143, 200), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将04", 地图, 0, Point(1163, 199), true, true)
                            范围刷新怪物从地图实例("镇妖神将04", 地图, 0, Point(1149, 199), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("重甲狂兽人04", 地图, 0, Point(1161, 204), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1161, 205), true, true)
    
                            范围刷新怪物从地图实例("破法狂兽人04", 地图, 0, Point(1151, 194), true, true)
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1151, 193), true, true)
    
                            范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1151, 204), true, true)
                            范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1161, 194), true, true)
                        end
                    elseif 层数 == 5 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("秘法之囚01", 地图, 0, Point(1017, 337), true, true)
                            地图:地图公告("<#T:990646>") --此妖王是 [秘法之囚]，使用法术攻击有奇效！
                            地图:地图公告("<#T:990646>") --此妖王是 [秘法之囚]，使用法术攻击有奇效！
                        else
                            范围刷新怪物从地图实例("神武之囚01", 地图, 0, Point(1017, 337), true, true)
                            地图:地图公告("<#T:990645>") --此妖王是 [神武之囚]，使用物理攻击有奇效！
                            地图:地图公告("<#T:990645>") --此妖王是 [神武之囚]，使用物理攻击有奇效！
                        end
                        范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1012, 337), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1012, 338), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1012, 339), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1018, 331), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1018, 332), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1018, 333), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1024, 337), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1024, 338), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1024, 339), true, true)
                        范围刷新怪物从地图实例("匍匐僵尸04", 地图, 0, Point(1018, 343), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1018, 344), true, true)
                        范围刷新怪物从地图实例("干枯僵尸04", 地图, 0, Point(1018, 345), true, true)
                    elseif 层数 == 6 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, Point(875, 480), true, true)
                            范围刷新怪物从地图实例("邪骸影射06", 地图, 0, Point(874, 481), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, Point(887, 468), true, true)
                            范围刷新怪物从地图实例("邪骸影射06", 地图, 0, Point(888, 467), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, Point(887, 479), true, true)
                            范围刷新怪物从地图实例("邪骸影射06", 地图, 0, Point(888, 480), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒06", 地图, 0, Point(876, 468), true, true)
                            范围刷新怪物从地图实例("邪骸影射06", 地图, 0, Point(875, 467), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(868, 475), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(868, 476), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(882, 461), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(882, 462), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(894, 473), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(894, 474), true, true)
                            
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(880, 487), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(880, 487), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将06", 地图, 0, Point(888, 474), true, true)
                            范围刷新怪物从地图实例("镇妖神将06", 地图, 0, Point(874, 474), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("霸体狂尸06", 地图, 0, Point(888, 480), true, true)
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(888, 481), true, true)
    
                            范围刷新怪物从地图实例("破法邪尸06", 地图, 0, Point(875, 467), true, true)
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(875, 466), true, true)
    
                            范围刷新怪物从地图实例("感染僵尸06", 地图, 0, Point(875, 480), true, true)
                            范围刷新怪物从地图实例("灰败僵尸06", 地图, 0, Point(888, 467), true, true)
                        end
                    elseif 层数 == 7 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, Point(1276, 318), true, true)
                            范围刷新怪物从地图实例("邪骸影射07", 地图, 0, Point(1275, 317), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, Point(1287, 318), true, true)
                            范围刷新怪物从地图实例("邪骸影射07", 地图, 0, Point(1288, 317), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, Point(1287, 329), true, true)
                            范围刷新怪物从地图实例("邪骸影射07", 地图, 0, Point(1288, 330), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒07", 地图, 0, Point(1275, 330), true, true)
                            范围刷新怪物从地图实例("邪骸影射07", 地图, 0, Point(1274, 331), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1268, 325), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1268, 326), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1282, 311), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1282, 312), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1294, 323), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1294, 324), true, true)
                            
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1280, 337), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1280, 338), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将07", 地图, 0, Point(1288, 325), true, true)
                            范围刷新怪物从地图实例("镇妖神将07", 地图, 0, Point(1274, 325), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("霸体狂尸07", 地图, 0, Point(1288, 331), true, true)
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1288, 332), true, true)
    
                            范围刷新怪物从地图实例("破法邪尸07", 地图, 0, Point(1275, 318), true, true)
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1275, 317), true, true)
    
                            范围刷新怪物从地图实例("感染僵尸07", 地图, 0, Point(1275, 331), true, true)
                            范围刷新怪物从地图实例("灰败僵尸07", 地图, 0, Point(1287, 319), true, true)
                        end
                    elseif 层数 == 8 then
                        if 随机值 == 0 then
                            范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, Point(1138, 456), true, true)
                            范围刷新怪物从地图实例("邪骸影射08", 地图, 0, Point(1137, 455), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, Point(1149, 456), true, true)
                            范围刷新怪物从地图实例("邪骸影射08", 地图, 0, Point(1150, 455), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, Point(1149, 467), true, true)
                            范围刷新怪物从地图实例("邪骸影射08", 地图, 0, Point(1150, 468), true, true)
                            范围刷新怪物从地图实例("邪骸悍卒08", 地图, 0, Point(1137, 468), true, true)
                            范围刷新怪物从地图实例("邪骸影射08", 地图, 0, Point(1136, 469), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1130, 463), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1130, 464), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1144, 449), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1144, 450), true, true)
    
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1156, 461), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1156, 462), true, true)
                            
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1142, 475), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1142, 476), true, true)
                        elseif 随机值 == 1 then
                            范围刷新怪物从地图实例("镇妖魔将08", 地图, 0, Point(1150, 463), true, true)
                            范围刷新怪物从地图实例("镇妖神将08", 地图, 0, Point(1136, 463), true, true)
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                            地图:地图公告("<#T:990644>") --两位暴走的守将会互相复活，需要同时将他们击败！
                        elseif 随机值 == 2 then
                            范围刷新怪物从地图实例("霸体狂尸08", 地图, 0, Point(1150, 469), true, true)
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1150, 470), true, true)
    
                            范围刷新怪物从地图实例("破法邪尸08", 地图, 0, Point(1137, 456), true, true)
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1137, 455), true, true)
    
                            范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1137, 468), true, true)
                            范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1149, 456), true, true)
                            地图:地图公告("<#T:990640>") --能力异常的怪物出现了！请冷静应对！
                            地图:地图公告("<#T:990643>") --这些魔物免疫特定攻击，勇士请注意您的攻击是否有效！
                            地图:地图公告("<#T:990643>") --这些魔物免疫特定攻击，勇士请注意您的攻击是否有效！
                        end
                    elseif 层数 == 9 then
                        if randomNum(0,1,true) == 0 then
                            范围刷新怪物从地图实例("秘法之囚02", 地图, 0, Point(1006, 601), true, true)
                        else
                            范围刷新怪物从地图实例("神武之囚02", 地图, 0, Point(1006, 601), true, true)
                        end
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1000, 599), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1000, 600), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1000, 601), true, true)
                        
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1006, 605), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1006, 606), true, true)
                        范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1006, 607), true, true)
    
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1012, 598), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1012, 599), true, true)
                        范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1012, 600), true, true)
    
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1007, 593), true, true)
                        范围刷新怪物从地图实例("灰败僵尸08", 地图, 0, Point(1007, 594), true, true)
                        范围刷新怪物从地图实例("感染僵尸08", 地图, 0, Point(1007, 595), true, true)
                    end
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(3.0)
                elseif 节点 == 4 then
                    if 地图.存活怪物总数 ~= 0 then
    
                    else
                        地图.副本节点 = 地图.副本节点 + 1
                        地图.节点计时 = 主程.当前时间:AddSeconds(1.0)
                    end
                elseif 节点 == 5 then
                    local 玩家列表 = 地图:获取玩家列表()
                    for i = 0, 玩家列表.Count - 1 do
                        local 玩家 = 玩家列表[i]
                        玩家.角色数据.脚本变量[数字_魔塔个人标准层数记录] = 层数
                    end
                    地图:地图公告("<#P0:".. 层数 .."><#P1:0><#T:666728>") --第[`~]波妖物已清除，请点击传送阵通往下层！
                    -- 地图:地图公告("<#P0:".. 层数 .."><#P1:10><#P2:20><#T:990314>")
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(1.0)
                elseif 节点 == 6 then
                    地图.副本节点 = 地图.副本节点 + 1
                    地图.节点计时 = 主程.当前时间:AddHours(1.0)
                    if 层数 == 1 then
                        刷新守卫从地图实例(7000, 地图, 游戏方向.下方, 魔塔传送阵刷新表[层数])
                        刷新守卫从地图实例(6813, 地图, 游戏方向.下方, Point(1040, 81))
                        刷新守卫从地图实例(6815, 地图, 游戏方向.下方, Point(1039, 82))
                    else
                        刷新守卫从地图实例(7000, 地图, 游戏方向.下方, 魔塔传送阵刷新表[层数])
                    end
                    if 层数 == 9 then
                        地图:地图公告("<#T:666729>") --恭喜您通过了所有的挑战！请点击传送阵离开魔塔！
                    else
                        地图:地图公告("<#T:50030>") --传送阵已开启，请点击前往下一层！
                    end
                end
            end
        end
    end
end