local 所在层数 = {
    [1] = {1028, 160},
    [2] = {881, 295},
    [3] = {733, 443},
    [4] = {1148, 280},
    [5] = {1001, 414},
    [6] = {853, 562},
    [7] = {1291, 410},
    [8] = {1144, 557},
    [9] = {996, 705},
}

function 九层妖塔_明河_主对话(玩家, 对话守卫, 选项编号, 界面层数)
    if 玩家.对话页面 == 0 then
        return "我已记不清在这里呆了多久，这里镇压着众多妖魔，你只要给我一张[妖兽秘卷]，我可以尝试着给你召唤一只玩玩！<#SO:1>提供一张[妖兽秘卷]<#SO/><#SO:2>让我考虑一下<#SO/>"
    end

    if 玩家.对话页面 == 1 then
        if 玩家.所属队伍 == nil then
            return "<#P0:0><#P1:0><#T:50603>" --你不在队伍当中。
        end

        if 玩家.所属队伍.队长编号 ~= 玩家.地图编号 then
            return "<#P0:0><#P1:0><#T:990109>" --你不是队长，请等待队长操作！
        end

        local 所需物品 = 玩家:根据编号获取背包物品(91114)
        local 随机怪物 = randomNum(1, 9, false)
        if 所需物品 ~= nil then
            玩家:消耗背包物品(1, 所需物品)
            if 随机怪物 == 1 then
                刷新怪物从地图实例("尸王02", 玩家.当前地图, 0, 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][1], 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][2], true, true)
            玩家:发送顶部公告("[尸王]：<font color='#FF0000'>我感受到了人类的气息，好久没有闻到这么香的味道了！</font>", true, false)
            elseif 随机怪物 == 2 then
                刷新怪物从地图实例("沃玛教主01", 玩家.当前地图, 0, 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][1], 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][2], true, true)
                玩家:发送顶部公告("[沃玛教主]：<font color='#FF0000'>我感受到了人类的气息，好久没有闻到这么香的味道了！</font>", true, false)
            elseif 随机怪物 == 3 then
                刷新怪物从地图实例("虹魔教主01", 玩家.当前地图, 0, 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][1], 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][2], true, true)
                玩家:发送顶部公告("[虹魔教主]：<font color='#FF0000'>我感受到了人类的气息，好久没有闻到这么香的味道了！</font>", true, false)
            elseif 随机怪物 == 4 then
                刷新怪物从地图实例("触龙神01", 玩家.当前地图, 0, 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][1], 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][2], true, true)
                玩家:发送顶部公告("[触龙神]：<font color='#FF0000'>我感受到了人类的气息，好久没有闻到这么香的味道了！</font>", true, false)
            elseif 随机怪物 == 5 then
                刷新怪物从地图实例("祖玛教主01", 玩家.当前地图, 0, 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][1], 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][2], true, true)
                玩家:发送顶部公告("[祖玛教主]：<font color='#FF0000'>我感受到了人类的气息，好久没有闻到这么香的味道了！</font>", true, false)
            elseif 随机怪物 == 6 then
                刷新怪物从地图实例("血手", 玩家.当前地图, 0, 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][1], 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][2], true, true)
                玩家:发送顶部公告("[血手]：<font color='#FF0000'>我感受到了人类的气息，好久没有闻到这么香的味道了！</font>", true, false)
            elseif 随机怪物 == 7 then
                刷新怪物从地图实例("赤月恶魔01", 玩家.当前地图, 0, 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][1], 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][2], true, true)
                玩家:发送顶部公告("[赤月恶魔]：<font color='#FF0000'>我感受到了人类的气息，好久没有闻到这么香的味道了！</font>", true, false)
            elseif 随机怪物 == 8 then
                刷新怪物从地图实例("烈焰恶魔", 玩家.当前地图, 0, 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][1], 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][2], true, true)
                玩家:发送顶部公告("[烈焰恶魔]：<font color='#FF0000'>我感受到了人类的气息，好久没有闻到这么香的味道了！</font>", true, false)
            elseif 随机怪物 == 9 then
                刷新怪物从地图实例("兽人大祭司", 玩家.当前地图, 0, 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][1], 所在层数[玩家.角色数据.脚本变量[数字_妖塔随机到的层数]][2], true, true)
                玩家:发送顶部公告("[兽人大祭司]：<font color='#FF0000'>我感受到了人类的气息，好久没有闻到这么香的味道了！</font>", true, false)
            end
        else
            return "你没有[妖兽秘卷]，我跟你玩个屁阿，快走开！<#SO:1>知道了<#SO/>"
        end
    end
end
return 九层妖塔_明河_主对话


