function 盟重省_阿诗_主对话(玩家, 对话守卫, 选项编号, 界面层数)
  local 页面表 = {
    [1] = "<#P0:0><#P1:0><#T:666833>",
    [2] = "<#P0:0><#P1:0><#T:667280>",
    [3] = "<#P0:0><#P1:0><#T:710284>",
    [4] = "<#P0:0><#P1:0><#T:668179>",
    [5] = "<#P0:0><#P1:0><#T:668184>",
    [6] = "<#P0:0><#P1:0><#T:668151>",
    [7] = "<#P0:0><#P1:0><#T:668160>",
  }

  if 玩家.管理员模式 then
    玩家:发送系统消息("".. 玩家.对话页面 .."")
  end

  if 玩家.对话页面 == 0 then
    if 主程.开区节点 < 2 then
      return "<#P0:0><#P1:0><#T:666470>"
    elseif 主程.开区节点 > 2 and 主程.开区节点 < 5 then
      return "<#P0:0><#P1:0><#T:666832>"
    else
      return "<#P0:0><#P1:0><#T:666835>"
    end
  end

  if 玩家.对话页面 > 0 and 玩家.对话页面 < 10 then
    return 页面表[玩家.对话页面]
  end


  if 玩家.对话页面 > 30 and 玩家.对话页面 < 50 then
    local 页面表 = {
      --      冷玉佩     页面ID   页面ID  页面ID  数量 数量  数量
      [31] = {99971101, 667945, 667946, 667947, 125, 145, 170},
      [32] = {99971102, 667948, 667949, 667950, 125, 145, 170},
      [33] = {99971103, 667951, 667952, 667953, 125, 145, 170},
      [34] = {99971104, 667954, 667955, 667956, 125, 145, 170},
      [35] = {99971105, 710281, 710282, 710283, 125, 145, 170},
      [36] = {99971106, 710285, 710286, 710287, 125, 145, 170},
      [41] = {99971101, 668135, 668136, 668137, 400, 450, 550},
      [42] = {99971102, 668138, 668139, 668140, 400, 450, 550},
      [43] = {99971103, 668141, 668142, 668143, 400, 450, 550},
      [44] = {99971104, 668144, 668145, 668146, 400, 450, 550},
      [45] = {99971105, 710291, 710292, 710293, 400, 450, 550},
      [46] = {99971106, 667945, 667946, 667947, 400, 450, 550},
    }
    local 装备 = 玩家:根据编号获取背包物品(页面表[玩家.对话页面][1])  -- 检测玉佩是否存在
    if 装备 ~= nil then
      if 装备.孔洞颜色.Count == 0 then
        return "<#P0:".. 页面表[玩家.对话页面][5] .."><#P1:0><#T:".. 页面表[玩家.对话页面][2] ..">"
      elseif 装备.孔洞颜色.Count == 1 then
        return "<#P0:".. 页面表[玩家.对话页面][6] .."><#P1:0><#T:".. 页面表[玩家.对话页面][3] ..">"
      elseif 装备.孔洞颜色.Count == 2 then
        return "<#P0:".. 页面表[玩家.对话页面][7] .."><#P1:0><#T:".. 页面表[玩家.对话页面][4] ..">"
      end
    else
      return "<#P0:0><#P1:0><#T:667958>"
    end
  end

  if 玩家.对话页面 > 50 and 玩家.对话页面 < 100 then
    local 页面表 = {
      [51] = {99971201, "在您的背包中找到了精修玉佩·赤霞(无孔)<br>您是否需要消耗：精修玉佩·赤霞(无孔)+30幸运币，兑换极品玉佩·赤霞(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·赤霞(单孔)<br>您是否需要消耗：精修玉佩·赤霞(单孔)+31幸运币，兑换极品玉佩·赤霞(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·赤霞(双孔)<br>您是否需要消耗：精修玉佩·赤霞(双孔)+33幸运币，兑换极品玉佩·赤霞(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [52] = {99971202, "在您的背包中找到了精修玉佩·湛波(无孔)<br>您是否需要消耗：精修玉佩·湛波(无孔)+30幸运币，兑换极品玉佩·湛波(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·湛波(单孔)<br>您是否需要消耗：精修玉佩·湛波(单孔)+31幸运币，兑换极品玉佩·湛波(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·湛波(双孔)<br>您是否需要消耗：精修玉佩·湛波(双孔)+33幸运币，兑换极品玉佩·湛波(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [53] = {99971203, "在您的背包中找到了精修玉佩·碧血(无孔)<br>您是否需要消耗：精修玉佩·碧血(无孔)+30幸运币，兑换极品玉佩·碧血(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·碧血(单孔)<br>您是否需要消耗：精修玉佩·碧血(单孔)+31幸运币，兑换极品玉佩·碧血(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·碧血(双孔)<br>您是否需要消耗：精修玉佩·碧血(双孔)+33幸运币，兑换极品玉佩·碧血(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [54] = {99971204, "在您的背包中找到了精修玉佩·木槿(无孔)<br>您是否需要消耗：精修玉佩·木槿(无孔)+30幸运币，兑换极品玉佩·木槿(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·木槿(单孔)<br>您是否需要消耗：精修玉佩·木槿(单孔)+31幸运币，兑换极品玉佩·木槿(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·木槿(双孔)<br>您是否需要消耗：精修玉佩·木槿(双孔)+33幸运币，兑换极品玉佩·木槿(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [55] = {99971205, "在您的背包中找到了精修玉佩·金雷(无孔)<br>您是否需要消耗：精修玉佩·金雷(无孔)+30幸运币，兑换极品玉佩·金雷(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·金雷(单孔)<br>您是否需要消耗：精修玉佩·金雷(单孔)+31幸运币，兑换极品玉佩·金雷(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·金雷(双孔)<br>您是否需要消耗：精修玉佩·金雷(双孔)+33幸运币，兑换极品玉佩·金雷(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [56] = {99971206, "在您的背包中找到了精修玉佩·褐岩(无孔)<br>您是否需要消耗：精修玉佩·褐岩(无孔)+30幸运币，兑换极品玉佩·褐岩(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·褐岩(单孔)<br>您是否需要消耗：精修玉佩·褐岩(单孔)+31幸运币，兑换极品玉佩·褐岩(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了精修玉佩·褐岩(双孔)<br>您是否需要消耗：精修玉佩·褐岩(双孔)+33幸运币，兑换极品玉佩·褐岩(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},

      [61] = {99990512, "在您的背包中找到了寒狼护肩(无孔)<br>您是否需要消耗：寒狼护肩(无孔)+200学宫积分，兑换破凰护肩(圣战)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了寒狼护肩(单孔)<br>您是否需要消耗：寒狼护肩(单孔)+300学宫积分，兑换破凰护肩(圣战)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了寒狼护肩(双孔)<br>您是否需要消耗：寒狼护肩(双孔)+450学宫积分，兑换破凰护肩(圣战)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [62] = {99990522, "在您的背包中找到了火纹护肩(无孔)<br>您是否需要消耗：火纹护肩(无孔)+200学宫积分，兑换破凰护肩(法神)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了火纹护肩(单孔)<br>您是否需要消耗：火纹护肩(单孔)+300学宫积分，兑换破凰护肩(法神)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了火纹护肩(双孔)<br>您是否需要消耗：火纹护肩(双孔)+450学宫积分，兑换破凰护肩(法神)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [63] = {99990532, "在您的背包中找到了流云护肩(无孔)<br>您是否需要消耗：流云护肩(无孔)+200学宫积分，兑换破凰护肩(天尊)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了流云护肩(单孔)<br>您是否需要消耗：流云护肩(单孔)+300学宫积分，兑换破凰护肩(天尊)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了流云护肩(双孔)<br>您是否需要消耗：流云护肩(双孔)+450学宫积分，兑换破凰护肩(天尊)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [64] = {99990542, "在您的背包中找到了霜影护肩(无孔)<br>您是否需要消耗：霜影护肩(无孔)+200学宫积分，兑换破凰护肩(影刺)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了霜影护肩(单孔)<br>您是否需要消耗：霜影护肩(单孔)+300学宫积分，兑换破凰护肩(影刺)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了霜影护肩(双孔)<br>您是否需要消耗：霜影护肩(双孔)+450学宫积分，兑换破凰护肩(影刺)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [65] = {99990552, "在您的背包中找到了绿萤护肩(无孔)<br>您是否需要消耗：绿萤护肩(无孔)+200学宫积分，兑换破凰护肩(箭灵)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了绿萤护肩(单孔)<br>您是否需要消耗：绿萤护肩(单孔)+300学宫积分，兑换破凰护肩(箭灵)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了绿萤护肩(双孔)<br>您是否需要消耗：绿萤护肩(双孔)+450学宫积分，兑换破凰护肩(箭灵)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [66] = {99990562, "在您的背包中找到了虎贲护肩(无孔)<br>您是否需要消耗：虎贲护肩(无孔)+200学宫积分，兑换破凰护肩(龙枪)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了虎贲护肩(单孔)<br>您是否需要消耗：虎贲护肩(单孔)+300学宫积分，兑换破凰护肩(龙枪)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了虎贲护肩(双孔)<br>您是否需要消耗：虎贲护肩(双孔)+450学宫积分，兑换破凰护肩(龙枪)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},

      [71] = {99990516, "在您的背包中找到了寒狼护腕(无孔)<br>您是否需要消耗：寒狼护腕(无孔)+75学宫积分，兑换破凰护腕(圣战)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了寒狼护腕(单孔)<br>您是否需要消耗：寒狼护腕(单孔)+150学宫积分，兑换破凰护腕(圣战)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了寒狼护腕(双孔)<br>您是否需要消耗：寒狼护腕(双孔)+300学宫积分，兑换破凰护腕(圣战)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [72] = {99990526, "在您的背包中找到了火纹护腕(无孔)<br>您是否需要消耗：火纹护腕(无孔)+75学宫积分，兑换破凰护腕(法神)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了火纹护腕(单孔)<br>您是否需要消耗：火纹护腕(单孔)+150学宫积分，兑换破凰护腕(法神)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了火纹护腕(双孔)<br>您是否需要消耗：火纹护腕(双孔)+300学宫积分，兑换破凰护腕(法神)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [73] = {99990536, "在您的背包中找到了流云护腕(无孔)<br>您是否需要消耗：流云护腕(无孔)+75学宫积分，兑换破凰护腕(天尊)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了流云护腕(单孔)<br>您是否需要消耗：流云护腕(单孔)+150学宫积分，兑换破凰护腕(天尊)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了流云护腕(双孔)<br>您是否需要消耗：流云护腕(双孔)+300学宫积分，兑换破凰护腕(天尊)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [74] = {99990546, "在您的背包中找到了霜影护腕(无孔)<br>您是否需要消耗：霜影护腕(无孔)+75学宫积分，兑换破凰护腕(影刺)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了霜影护腕(单孔)<br>您是否需要消耗：霜影护腕(单孔)+150学宫积分，兑换破凰护腕(影刺)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了霜影护腕(双孔)<br>您是否需要消耗：霜影护腕(双孔)+300学宫积分，兑换破凰护腕(影刺)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [75] = {99990556, "在您的背包中找到了绿萤护腕(无孔)<br>您是否需要消耗：绿萤护腕(无孔)+75学宫积分，兑换破凰护腕(箭灵)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了绿萤护腕(单孔)<br>您是否需要消耗：绿萤护腕(单孔)+150学宫积分，兑换破凰护腕(箭灵)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了绿萤护腕(双孔)<br>您是否需要消耗：绿萤护腕(双孔)+300学宫积分，兑换破凰护腕(箭灵)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
      [76] = {99990566, "在您的背包中找到了虎贲护腕(无孔)<br>您是否需要消耗：虎贲护腕(无孔)+75学宫积分，兑换破凰护腕(龙枪)(无孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了虎贲护腕(单孔)<br>您是否需要消耗：虎贲护腕(单孔)+150学宫积分，兑换破凰护腕(龙枪)(单孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>", "在您的背包中找到了虎贲护腕(双孔)<br>您是否需要消耗：虎贲护腕(双孔)+300学宫积分，兑换破凰护腕(龙枪)(双孔)？<#SO:1>确认兑换<#SO/><#SO:2>取消<#SO/>"},
    }
    local 装备 = 玩家:根据编号获取背包物品(页面表[玩家.对话页面][1])  -- 检测玉佩是否存在
    if 装备 ~= nil then
      if 装备.孔洞颜色.Count == 0 then
        return "".. 页面表[玩家.对话页面][2] ..""
      elseif 装备.孔洞颜色.Count == 1 then
        return "".. 页面表[玩家.对话页面][3] ..""
      elseif 装备.孔洞颜色.Count == 2 then
        return "".. 页面表[玩家.对话页面][4] ..""
      end
    else
      return "<#P0:0><#P1:0><#T:667958>"
    end
  end

  if 玩家.对话页面 > 300 then
    local 页面表 = {
      [311] = {99971101, 111048, 99971201, 125, 145, 170},
      [321] = {99971102, 111049, 99971202, 125, 145, 170},
      [331] = {99971103, 111050, 99971203, 125, 145, 170},
      [341] = {99971104, 111080, 99971204, 125, 145, 170},
      [351] = {99971105, 111093, 99971205, 125, 145, 170},
      [361] = {99971106, 111303, 99971206, 125, 145, 170},
      [411] = {99971101, 91143, 99971201, 400, 450, 550},
      [421] = {99971102, 91143, 99971202, 400, 450, 550},
      [431] = {99971103, 91143, 99971203, 400, 450, 550},
      [441] = {99971104, 91143, 99971204, 400, 450, 550},
      [451] = {99971105, 91143, 99971205, 400, 450, 550},
      [461] = {99971106, 91143, 99971206, 400, 450, 550},
      [511] = {99971201, 91185, 99971301, 30, 31, 33},
      [521] = {99971202, 91185, 99971302, 30, 31, 33},
      [531] = {99971203, 91185, 99971303, 30, 31, 33},
      [541] = {99971204, 91185, 99971304, 30, 31, 33},
      [551] = {99971205, 91185, 99971305, 30, 31, 33},
      [561] = {99971206, 91185, 99971306, 30, 31, 33},

      [611] = {99990512, 91143, 99990712, 200, 300, 450},
      [621] = {99990522, 91143, 99990722, 200, 300, 450},
      [631] = {99990532, 91143, 99990732, 200, 300, 450},
      [641] = {99990542, 91143, 99990742, 200, 300, 450},
      [651] = {99990552, 91143, 99990752, 200, 300, 450},
      [661] = {99990562, 91143, 99990762, 200, 300, 450},

      [711] = {99990516, 91143, 99990716, 75, 150, 300},
      [721] = {99990526, 91143, 99990726, 75, 150, 300},
      [731] = {99990536, 91143, 99990736, 75, 150, 300},
      [741] = {99990546, 91143, 99990746, 75, 150, 300},
      [751] = {99990556, 91143, 99990756, 75, 150, 300},
      [761] = {99990566, 91143, 99990766, 75, 150, 300},
    }
    local 装备 = 玩家:根据编号获取背包物品(页面表[玩家.对话页面][1])
    if 装备 ~= nil then
      local 材料数量 = 0
      if 装备.孔洞颜色.Count == 0 then
        材料数量 = 页面表[玩家.对话页面][4]
      elseif 装备.孔洞颜色.Count == 1 then
        材料数量 = 页面表[玩家.对话页面][5]
      elseif 装备.孔洞颜色.Count == 2 then
        材料数量 = 页面表[玩家.对话页面][6]
      end
      local 材料 = 玩家:查找背包物品(页面表[玩家.对话页面][2], 材料数量)
      if 材料 == nil then
        return "<#P0:0><#P1:0><#T:667959>"
      end
      玩家:消耗背包物品(材料数量, 材料, "兑换玉佩")
      盟重省_阿诗_确认兑换(玩家, 装备, 页面表[玩家.对话页面][3])
    else
      return "<#P0:0><#P1:0><#T:668148>"
    end
  end

end

function 盟重省_阿诗_确认兑换(玩家, 装备, 物品编号)
  local 网络 = 玩家.角色数据.网络连接

  装备.对应模板.V = 游戏装备.数据表[物品编号]

  local 删除物品 = 删除玩家物品()
  删除物品.背包类型 = 装备.物品容器.V
  删除物品.物品位置 = 装备.物品位置.V
  网络:发送封包(删除物品)

  local 物品变动 = 玩家物品变动()
  物品变动.物品描述 = 装备:字节描述()
  网络:发送封包(物品变动)
end

return 盟重省_阿诗_主对话