function 赤月群岛_古老神树_主对话(玩家, 对话守卫, 选项编号, 界面层数)
    local 功能表 = {
        [true] = {
            [0] = "<#P0:0><#P1:0><#T:711014>",
            [1] = 赤月群岛_古老神树_查看阵营总贡献,
            [2] = 赤月群岛_古老神树_查看我的本轮贡献
        },
        [false] = {
            [0] = "<#P0:0><#P1:0><#T:711015>",
            [1] = 赤月群岛_古老神树_查看开启时间
        }
    }
    local 是否开启 = true -- 这里的变量是测试用的
    return 返回字符结果(功能表[是否开启][玩家.对话页面], 玩家)
    -- 
    -- if 玩家.对话页面 == 0 then
    --     if 是否开启 then
    --         return "<#P0:0><#P1:0><#T:711014>"
    --     else
    --         return "<#P0:0><#P1:0><#T:711015>"
    --     end
    -- end
end

function 赤月群岛_古老神树_查看开启时间(玩家)
    return "<#P0:0><#P1:0><#T:711027>"
    -- return "<#P0:0><#P1:0><#T:711028>" -- P0 = 多少分钟后开启
end

function 赤月群岛_古老神树_查看阵营总贡献(玩家)
    
end

function 赤月群岛_古老神树_查看我的本轮贡献(玩家)
    return "<#P0:0><#P1:0><#T:711017>" -- P0 = 我的本轮贡献值
end

return 赤月群岛_古老神树_主对话