function 赤月群岛_妖族白鹿_主对话(玩家, 对话守卫, 选项编号, 界面层数)
    -- 706 已经选择过阵容 707 染血之锋 708 神树守护
    local 玩家阵营 = 1
    if 玩家.角色数据.角色变量[706] == 0 then
        玩家阵营 = 1
    end
    if 玩家.角色数据.角色变量[706] == 1 and 玩家.角色数据.角色变量[707] == 1 then
        玩家阵营 = 2
    end
    if 玩家.角色数据.角色变量[706] == 1 and 玩家.角色数据.角色变量[708] == 1 then
        玩家阵营 = 3
    end

    local 对话表 = 
    {
        [0] = {"<#P0:0><#P1:0><#T:711005>", "<#P0:0><#P1:0><#T:711008>", "<#P0:0><#P1:0><#T:711007>"},

        [1] = {"<#P0:0><#P1:0><#T:711034>", 赤月群岛_妖族白鹿_查询贡献, ""},
        [11] = {赤月群岛_妖族白鹿_加入染血之锋, "", ""},
        [12] = {"", "", ""},
        [111] = {"", "", ""},

        [2] = {"", "<#P0:0><#P1:0><#T:711011>", ""},
        [21] = {"", 赤月群岛_妖族白鹿_退出染血之锋, ""},
        [22] = {"", "", ""},


        [3] = {"", "", ""},
    }
    
    if 对话表[玩家.对话页面] ~= nil and 对话表[玩家.对话页面][玩家阵营] ~= nil then
        return 返回字符结果(对话表[玩家.对话页面][玩家阵营], 玩家)
    end
end

function 赤月群岛_妖族白鹿_加入染血之锋(玩家)
    if 玩家.角色数据.脚本变量[数字_赤月群岛阵营冷却] == tonumber(os.date("%j")) then
        return "<#P0:0><#P1:0><#T:711013>"
    end
    玩家:修改角色变量(706, 1)
    玩家:修改角色变量(707, 1)
    玩家:添加Buff时处理(46430, nil)
    return "<#P0:0><#P1:0><#T:711024>"
end

function 赤月群岛_妖族白鹿_退出染血之锋(玩家)
    玩家.角色数据.脚本变量[数字_赤月群岛阵营冷却] = tonumber(os.date("%j"))
    玩家:修改角色变量(706, 0)
    玩家:修改角色变量(707, 0)
    玩家:删除Buff时处理(46430)
    return ""
end

function 赤月群岛_妖族白鹿_查询贡献(玩家)
    return "<#P0:0><#P1:0><#T:711036>" -- 未开启提示
    -- return "<#P0:0><#P1:0><#T:711010>" -- P0 = 我的本轮贡献值
end


return 赤月群岛_妖族白鹿_主对话